package homework1;

import java.util.Scanner;

public class Task10 {
  //10. Напишите программу с тремя переменными целого типа, первым двум присвойте значения, а третьей переменной присвойте их сумму. Выведете значение третей переменной на экран.
  public static void task10() {
    Scanner scanner = new Scanner(System.in);
    System.out.println("Enter a: ");
    int a = scanner.nextInt();
    System.out.println("Enter b: ");
    int b = scanner.nextInt();
    int c = a + b;
    System.out.println("Sum : " + c );
  }






  }
